In [1]:
import pandas as pd
import seaborn as sb

In [2]:
ds=pd.read_csv("Rent Data.csv")
ds.head()

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100

In [3]:
ds.tail()

    area   rent
24  2800  50000
25  3100  53000
26  2750  48000
27  1800  25000
28  2200  31460

In [4]:
ds.shape

(29, 2)

In [5]:
#1.Normalization/MinMaxScal
from sklearn.preprocessing import MinMaxScaler

In [19]:
mmx=MinMaxScaler(feature_range=(3,5)) #creat obj for min max scaler

In [20]:
a_fit=mmx.fit(ds[["area"]])
a_fit

MinMaxScaler(feature_range=(3, 5))

In [21]:
ds.head()

       area   rent
0  0.347826  0.230
1  0.391304  0.300
2  0.565217  0.421
3  0.456522  0.322
4  0.782609  0.642

In [22]:
ds["area"]=mmx.transform(ds[["area"]])#trnsform the data
ds.head()

       area   rent
0  3.695652  0.230
1  3.782609  0.300
2  4.130435  0.421
3  3.913043  0.322
4  4.565217  0.642

In [23]:
#at a time fit and trnsform
ds["rent"]=mmx.fit_transform(ds[["rent"]])
ds.head()

       area   rent
0  3.695652  3.460
1  3.782609  3.600
2  4.130435  3.842
3  3.913043  3.644
4  4.565217  4.284

In [24]:
#2.StandardScaler
ds2=pd.read_csv("Rent Data.csv")
ds2.head()

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100

In [25]:
#StandardScaler
from sklearn.preprocessing import StandardScaler

In [30]:
sts=StandardScaler()

In [31]:
ds2["area"]=sts.fit_transform(ds2[["area"]])
ds2.head()

       area      rent
0 -0.496601 -0.451586
1 -0.305093 -0.147755
2  0.460941  0.377439
3 -0.017830 -0.052265
4  1.418484  1.336678

In [32]:
ds2["rent"]=sts.fit_transform(ds2[["rent"]])
ds2.head()

       area      rent
0 -0.496601 -0.451586
1 -0.305093 -0.147755
2  0.460941  0.377439
3 -0.017830 -0.052265
4  1.418484  1.336678

In [38]:
#3.Robust Scaler
ds3=pd.read_csv('Salary_Data.csv')
ds3.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [39]:
from sklearn.preprocessing import RobustScaler
rbs=RobustScaler()

In [43]:
ds3["YearsExperience"]=rbs.fit_transform(ds3[["YearsExperience"]])
ds3.head()

   YearsExperience   Salary
0        -0.800000  39343.0
1        -0.755556  46205.0
2        -0.711111  37731.0
3        -0.600000  43525.0
4        -0.555556  39891.0

In [44]:
ds3['Salary']=rbs.fit_transform(ds3[["Salary"]])

In [45]:
ds3.head()

   YearsExperience    Salary
0        -0.800000 -0.590863
1        -0.755556 -0.434283
2        -0.711111 -0.627647
3        -0.600000 -0.495436
4        -0.555556 -0.578359

In [48]:
#4.Max Absulate Scaler
ds4=pd.read_csv("Salary_Data.csv")
ds4.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [57]:
from sklearn.preprocessing import MaxAbsScaler

In [58]:
mas=MaxAbsScaler()

In [59]:
ds4["YearsExperience"]=mas.fit_transform(ds4[["YearsExperience"]])

In [60]:
ds4.head()

   YearsExperience   Salary
0         0.104762  39343.0
1         0.123810  46205.0
2         0.142857  37731.0
3         0.190476  43525.0
4         0.209524  39891.0

In [61]:
ds4["Salary"]=mas.fit_transform(ds4[["Salary"]])

In [62]:
ds4.head()

   YearsExperience    Salary
0         0.104762  0.321453
1         0.123810  0.377520
2         0.142857  0.308282
3         0.190476  0.355623
4         0.209524  0.325931